Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Returns the array element in the previous place that 's pointed by the internal array pointer, or FALSE if there are no more elements.
pt_br: Retorna o elemento do array que está na posição anterior a posição apontada pelo ponteiro interno, ou FALSE se houver mais elementos.

source: If the array contains empty elements then this function will return FALSE for these elements as well.
pt_br: Se o array contiver elementos vazios então essa função retornará FALSE para esses elementos.

source: To properly traverse an array which may contain empty elements see the each() function.
pt_br: Para percorrer corretamente arrays que podem conter elementos vazios veja a função each().

source: prev() behaves just like next(), except it rewinds the internal array pointer one place instead of advancing it.
pt_br: prev() funciona da mesma forma que next(), com a única diferença sendo de que a primeira retrocede o ponteiro interno em uma posição ao invés de avançá-lo.

source: See also current(), end(), next(), and reset().
pt_br: Veja também current(), end(), next() e reset().

source: Example 1. printer_abort() example
pt_br: Exemplo 1. printer_abort() example

source: Example 1. printer_close() example
pt_br: Exemplo 1. printer_close() example

source: The function creates a new brush and returns a handle to it.
pt_br: Description

source: Example 1. printer_create_dc() example
pt_br: Exemplo 1. printer_create_dc() example

source: The function creates a new font and returns a handle to it.
pt_br: Description

source: The function creates a new pen and returns a handle to it.
pt_br: Description

source: Example 1. printer_draw_bmp() example
pt_br: Exemplo 1. printer_draw_bmp() example

source: The function simply draws an chord. handle must be a valid handle to a printer.
pt_br: Description

source: $handle = printer_open(); printer_start_doc($handle, "My Document"); printer_start_page($handle); $pen = printer_create_pen(PRINTER_PEN_SOLID, 2, "000000"); printer_select_pen($handle, $pen); $brush = printer_create_brush(PRINTER_BRUSH_SOLID, "2222FF"); printer_select_brush($handle, $brush); printer_draw_chord($handle, 1, 1, 500, 500, 1, 1, 500, 1); printer_delete_brush($brush); printer_delete_pen($pen); printer_end_page($handle); printer_end_doc($handle); printer_close($handle);
pt_br: Exemplo 1. printer_draw_chord() example

source: The function simply draws an ellipse. handle must be a valid handle to a printer.
pt_br: Description

source: $handle = printer_open(); printer_start_doc($handle, "My Document"); printer_start_page($handle); $pen = printer_create_pen(PRINTER_PEN_SOLID, 2, "000000"); printer_select_pen($handle, $pen); $brush = printer_create_brush(PRINTER_BRUSH_SOLID, "2222FF"); printer_select_brush($handle, $brush); printer_draw_elipse($handle, 1, 1, 500, 500); printer_delete_brush($brush); printer_delete_pen($pen); printer_end_page($handle); printer_end_doc($handle); printer_close($handle);
pt_br: Exemplo 1. printer_draw_elipse() example

source: Example 1. printer_draw_line() example
pt_br: Exemplo 1. printer_draw_line() example

source: The function simply draws an pie. handle must be a valid handle to a printer.
pt_br: Description

source: $handle = printer_open(); printer_start_doc($handle, "My Document"); printer_start_page($handle); $pen = printer_create_pen(PRINTER_PEN_SOLID, 2, "000000"); printer_select_pen($handle, $pen); $brush = printer_create_brush(PRINTER_BRUSH_SOLID, "2222FF"); printer_select_brush($handle, $brush); printer_draw_pie($handle, 1, 1, 500, 500, 1, 1, 500, 1); printer_delete_brush($brush); printer_delete_pen($pen); printer_end_page($handle); printer_end_doc($handle); printer_close($handle);
pt_br: Exemplo 1. printer_draw_pie() example

source: $handle = printer_open(); printer_start_doc($handle, "My Document"); printer_start_page($handle); $pen = printer_create_pen(PRINTER_PEN_SOLID, 2, "000000"); printer_select_pen($handle, $pen); $brush = printer_create_brush(PRINTER_BRUSH_SOLID, "2222FF"); printer_select_brush($handle, $brush); printer_draw_rectangle($handle, 1, 1, 500, 500); printer_delete_brush($brush); printer_delete_pen($pen); printer_end_page($handle); printer_end_doc($handle); printer_close($handle);
pt_br: Exemplo 1. printer_draw_rectangle() example

source: The function simply draws a rectangle with rounded corners.
pt_br: Description

source: $handle = printer_open(); printer_start_doc($handle, "My Document"); printer_start_page($handle); $pen = printer_create_pen(PRINTER_PEN_SOLID, 2, "000000"); printer_select_pen($handle, $pen); $brush = printer_create_brush(PRINTER_BRUSH_SOLID, "2222FF"); printer_select_brush($handle, $brush); printer_draw_roundrect($handle, 1, 1, 500, 500, 200, 200); printer_delete_brush($brush); printer_delete_pen($pen); printer_end_page($handle); printer_end_doc($handle); printer_close($handle);
pt_br: Exemplo 1. printer_draw_roundrect() example

source: Example 1. printer_draw_text() example
pt_br: Exemplo 1. printer_draw_text() example

source: Example 1. printer_get_option() example
pt_br: Exemplo 1. printer_get_option() example

source: Example 1. printer_list() example
pt_br: Exemplo 1. printer_list() example

source: Example 1. printer_logical_fontheight() example
pt_br: Exemplo 1. printer_logical_fontheight() example

source: Example 1. printer_open() example
pt_br: Exemplo 1. printer_open() example

source: Example 1. printer_select_brush() example
pt_br: Exemplo 1. printer_select_brush() example

source: Example 1. printer_select_font() example
pt_br: Exemplo 1. printer_select_font() example

source: Example 1. printer_select_pen() example
pt_br: Exemplo 1. printer_select_pen() example

source: Example 1. printer_set_option() example
pt_br: Exemplo 1. printer_set_option() example

source: The function creates a new document in the printer spooler.
pt_br: Description

source: Example 1. printer_start_doc() example
pt_br: Exemplo 1. printer_start_doc() example

source: Example 1. printer_write() example
pt_br: Exemplo 1. printer_write() example

source: Produces output according to format, which is described in the documentation for sprintf().
pt_br: Produz uma saída de acordo com format, o qual é descrito na documentação para sprintf().

source: See also print(), sprintf(), sscanf(), fscanf(), and flush().
pt_br: Veja também print(), sprintf(), sscanf(), fscanf(), e flush().

source: print() is not actually a real function (it is a language construct) so you are not required to use parentheses with it.
pt_br: print() não é atualmente uma função real (é uma construção da linguagem) então você não precisa usar parêntesis com ela.

source: Example 1. print() examples
pt_br: Exemplos print()

source: ?php print( "Hello World"); print "print() also works without parentheses ."; print "This spans multiple lines.
pt_br: ?php print( "Alô Mundo"); print "print() também funciona sem parênteses ."; print "Isto divide em múltiplas linhas.

# The newlines will be output as well"; print "This spans multiple lines.
source: The newlines will be output as well"; print "This spans\nmultiple lines.
pt_br: As quebras de linha serão mostradas também"; print "Isto divide\nem múltiplas linhas.

source: The newlines will be\noutput as well ."; print "escaping characters is done \"Like this\" ."; / / You can use variables inside of an print statement $foo = "foobar"; $bar = "barbaz"; print "foo is $foo"; / / foo is foobar / / Using single quotes will print the variable name, not the value print'foo is $foo'; / / foo is $foo / / If you are not using any other characters, you can just print variables print $foo; / / foobar print END This uses the "here document "syntax to output multiple lines with $variable interpolation.
pt_br: As quebras de linha serão\nmostradas também"; print "escapar caracteres é feito \"como isto\" ."; / / Você pode usar variáveis dentro do $foo = "foobar"; $bar = "barbaz"; print "foo is $foo"; / / foo is foobar / / Usando apóstrofos irá exibir o nome da variável, não o valor print 'foo is $foo'; / / foo is $foo / / Se você não estiver usando outros caracteres, somente mostre a variável print $foo; / / foobar print END Isto usa a sintaxe "aqui documento "para mostrar múltiplas linhas com interpolação de $variable interpolation.

source: Note that the here document terminator must appear on a line with just a semicolon no extra whitespace!
pt_br: Note que o terminador de aqui documento deve aparecer em uma linha terminada em ponto e vírgula(;) sem nenhum espaço extra!

source: See also echo(), printf(), and flush().
pt_br: Veja também echo(), printf(), e flush().

source: As with anything that outputs its result directly to the browser, you can use the output-control functions to capture the output of this function, and save it in a string (for example).
pt_br: Como toda saída é normalmente enviada direto para o browser, você pode usar as Funções de Controle de Output para capturar o resultado e guardá-lo em uma string (por exemplo).

source: pspell_add_to_personal() adds a word to the personal wordlist.
pt_br: Description

source: Example 1. pspell_add_to_personal()
pt_br: Exemplo 1. pspell_add_to_personal()

source: Example 1. pspell_check()
pt_br: Exemplo 1. pspell_check()

source: pspell_clear_session() clears the current session.
pt_br: Description

source: Example 1. pspell_config_create()
pt_br: Exemplo 1. pspell_config_create()

source: Example 1. pspell_config_ignore()
pt_br: Exemplo 1. pspell_config_ignore()

source: Example 1. pspell_config_mode()
pt_br: Exemplo 1. pspell_config_mode()

source: Example 1. pspell_config_personal()
pt_br: Exemplo 1. pspell_config_personal()

source: Example 1. pspell_config_repl()
pt_br: Exemplo 1. pspell_config_repl()

source: Example 1. pspell_config_runtogether()
pt_br: Exemplo 1. pspell_config_runtogether()

source: Example 1. pspell_new_config()
pt_br: Exemplo 1. pspell_new_config()

source: Example 1. pspell_new()
pt_br: Exemplo 1. pspell_new()

source: Example 1. pspell_new_personal()
pt_br: Exemplo 1. pspell_new_personal()

source: Example 1. pspell_store_replacement()
pt_br: Exemplo 1. pspell_store_replacement()

source: Example 1. pspell_suggest()
pt_br: Exemplo 1. pspell_suggest()

source: Adds setting to the server environment.
pt_br: Description

source: This function returns an 8-bit binary string corresponding to the decoded quoted printable string.
pt_br: Esta função retorna uma string de 8-bit correspondendo a string quoted-printable decodificada.

source: This function is similar to imap_qprint(), except this one does not require the IMAP module to work.
pt_br: Esta função é similar a imap_qprint(), com a exceção de não requerer o módulo IMAP para funcionar.

source: Returns a version of str with a backslash character (\) before every character that is among these:
pt_br: Retorna uma versão de str com uma barra invertida (\) entes de cada um destes caracteres:

source: See also addslashes(), htmlentities(), htmlspecialchars(), nl2br(), and stripslashes().
pt_br: Veja também addslashes(), htmlentities(), htmlspecialchars(), nl2br(), and stripslashes().

source: This function converts number from radian to degrees.
pt_br: Esta função converte number de radianos para graus.

source: See also deg2rad().
pt_br: Veja também deg2rad().

source: If called without the optional min, max arguments rand() returns a pseudo-random value between 0 and RAND_MAX.
pt_br: Se chamado sem os parâmetros opcionais min e max, rand() retornará um pseudo valor randômico entre 0 e RAND_MAX.

source: If you want a random number between 5 and 15 (inclusive), for example, use rand (5, 15).
pt_br: Se você precisa de um número aleatório entre 5 e 15 (inclusive), por exemplo, utilize rand (5, 15).

source: In older versions of PHP, you had to seed the random number generator before use with srand().
pt_br: Em versões anteriores do PHP, você precisa semear o gerador de números aletórios primeiro com srand().

source: To get the same results in these versions the short example should be rand (5, 11) to get a random number between 5 and 15.
pt_br: Assim, para obter os mesmos resultados do exemplo acima, você precisaria utilizar rand (5, 11) para obter um número aleatório entre 5 e 15.

source: See also srand(), getrandmax(), and mt_rand().
pt_br: Veja também srand(), getrandmax() e mt_rand().

source: range() returns an array of elements from low to high, inclusive.
pt_br: Descrição

source: New parameter:
pt_br: range() retorna um array com elementos de low até high, com intervalo fechado.

source: The optional step parameter was added in 5.0.0.
pt_br: Se low high, será de high até low.

source: If a step value is given, it will be used as the increment between elements in the sequence. step should be given as a positive number.
pt_br: Se o parâmetro step for especificado, será usado como o incremento entre os elementos da sequência. step deve ser um inteiro positivo.

source: If not specified, step will default to 1.
pt_br: Se não for especificado, step terá valor igual a 1.

source: Example 1. range() examples
pt_br: Exemplos de range()

source: ?php / / array( 0,1,2,3,4,5,6,7,8,9) foreach(range(0, 9) as $number) {echo $number;} / / The step parameter was introduced in 5.0.0 / / array(0,10,20,30,40,50,60,70,80,90,100) foreach(range(0, 100, 10) as $number) {echo $number;} / / Use of characters introduced in 4.1.0 / / array('a' ,'b' ,'c' ,'d' ,'e' ,'f' ,'g' ,'h' ,'i'); foreach(range('a', 'i') as $letter) {echo $letter;} / / array('c' ,'b' ,'a'); foreach(range('c', 'a') as $letter) {echo $letter;}?
pt_br: Nota:

source: Prior to version 4.1.0 the range() function only generated incrementing integer arrays.
pt_br: O parâmetro step foi adicionado na versão 5.0.0.

source: Support for character sequences and decrementing arrays was added in 4.1.0.
pt_br: Simulando faixas decrescentes e sequências de caracteres

source: See also shuffle() and foreach.
pt_br: Veja shuffle() para outro exemplo de utilização dessa função.

source: Example 1. rawurlencode() example 1
pt_br: Exemplo 1. rawurlencode() example 1

source: Example 2. rawurlencode() example 2
pt_br: Exemplo 2. rawurlencode() example 2

source: Returns the filename of the next file from the directory.
pt_br: Retorna o nome de arquivo do próximo arquivo do diretório.

source: The filenames are returned in the order in which they are stored by the filesystem.
pt_br: Os nomes de arquivos ão retornados na ordem informada pelo sistema de arquivos.

source: Please note the fashion in which readdir() 's return value is checked in the examples below.
pt_br: Verifique cuidadosamente o estilo de checagem dos valores retornados por readdir() nos exemplos abaixo.

source: We are explicitly testing whether the return value is identical to (equal to and of the same type as--see Comparison Operators for more information) FALSE since otherwise, any directory entry whose name evaluates to FALSE will stop the loop (e.g. a directory named "0").
pt_br: De outra forma, qualquer entrada de diretório que seja avaliada para FALSE irá parar o loop (por exemplo, um diretório nomeado "0").

source: List all files in a directory
pt_br: Lista todos os arquivos em um diretório

source: / / Note that !== did not exist until 4.0.0-RC2 ?php if ($handle = opendir(' / path / to / files')) {echo "Directory handle: $handle\n"; echo "Files:\n"; / * This is the correct way to loop over the directory. * / while (false !== ($file = readdir($handle))) {echo "$file\n";} / * This is the WRONG way to loop over the directory. * / while ($file = readdir($handle)) {echo "$file\n";} closedir($handle);}?
pt_br: / / Note que !== não existia antes do PHP 4.0.0-RC2 ?php if ($handle = opendir(' / path / to / files')) {echo "Manipulador de diretório: $handle\n"; echo "Arquivos:\n"; / * Esta é a forma correta de varrer o diretório * / while (false !== ($file = readdir($handle))) {echo "$file\n";} / * Esta é a forma INCORRETA de varrer o diretório * / while ($file = readdir($handle)) {echo "$file\n";} closedir($handle);}?

source: Note that readdir() will return the. and.. entries.
pt_br: Note que readdir() irá retornar o. e...

source: If you don 't want these, simply strip them out:
pt_br: Se você não quer estes simplesmente os retire:

source: List all files in the current directory and strip out. and..
pt_br: Listar todos os arquivos no diretório atual e retirar. e..

source: The read_exif_data() function is an alias for exif_read_data().
pt_br: Nota:

source: Reads a file and writes it to the output buffer.
pt_br: Descrição

source: Returns the number of bytes read from the file.
pt_br: Lê um arquivo e escreve o seu conteúdo para o buffer de saída( output buffer).

source: If an error occurs, FALSE is returned and unless the function was called as @readfile, an error message is printed.
pt_br: Se um error ocorrer, retorna FALSE e ao menos que a função seja chamada como @readfile, uma mensagem de erro será impressa.

source: You can use the optional second parameter and set it to "1", if you want to search for the file in the include_path, too.
pt_br: Você pode usar o segundo parametro opcional e o setar para "1", se você quiser procurar o arquivo no include_path, também.

source: See also fpassthru(), file(), fopen(), include(), require(), virtual() and Appendix I.
pt_br: Veja também fpassthru(), file(), fopen(), include(), require(), virtual() e Apêndice I.

source: Reads a file, decompresses it and writes it to standard output.
pt_br: Description

source: This function registers a completion function.
pt_br: Description

source: Example 1. readline()
pt_br: Exemplo 1. readline()

source: readlink() does the same as the readlink C function and returns the contents of the symbolic link path or 0 in case of error.
pt_br: readlink() faz o mesmo que a função do C readlink e retorna os conteúdos do path do link simbólico ou 0 em caso de erro.

source: See also is_link(), symlink(), and linkinfo().
pt_br: Veja também symlink(), readlink() e linkinfo().

source: realpath() expands all symbolic links and resolves references to '/. /', '/.. /' and extra '/' characters in the input path and return the canonicalized absolute pathname.
pt_br: realpath() expande todos os links simbólicos e resolve referencias para '/. /', '/.. /' e extra caracteres '/' na entrada pelo path e retorna o path absoluto canonicalizado.

source: The resulting path will have no symbolic link, '/. /' or '/.. /' components.
pt_br: O path resultante não conterá nenhum link simbólico ou componentes '/. /' e '/.. /'.

source: realpath() returns FALSE on failure, e.g. if the file does not exists.
pt_br: realpath() retorna FALSE em caso de falha, por exemplo, se o caminho não existir.

source: Example 1. realpath() example
pt_br: Exemplo 1. exemplo de realpath()

source: See also: basename(), dirname(), and pathinfo().
pt_br: Veja também: basename(), dirname() e pathinfo().

source: This is an alias for recode_string().
pt_br: Nota:

source: Attempts to rename oldname to newname.
pt_br: Tenta renomear nomeantigo para novonome.

source: Example with rename()
pt_br: Exemplo de rename()

source: The require() statement includes and evaluates the specific file.
pt_br: A instrução require() inclui a avalia um arquivo específico.

source: Detailed information on how this inclusion works is described in the documentation for include().
pt_br: Informações detalhadas de como essa inclusão funciona está descrita na documentação do include().

source: require() and include() are identical in every way except how they handle failure. include() produces a Warning while require() results in a Fatal Error.
pt_br: require() e include() são idênticos em todas as formas exceto pela manipulação de erros. include() produz um Warning enquanto require() produzirá um Fatal Error.

source: In other words, don' t hesitate to use require() if you want a missing file to halt processing of the page. include() does not behave this way, the script will continue regardless.
pt_br: Em outras palavras, não hesite em utilizar require() se na falta de um arquivo quiser parar o processamento da página. include() não se comporta da mesma maneira, e o script poderá continuar nessa situação.

source: Example 12-2.
pt_br: Exemplo 12-2.

source: Basic require() examples
pt_br: Exemplos de require() s simples

source: See the include() documentation for more examples.
pt_br: Vaja a documentação de include() para mais exemplos.

source: Prior to PHP 4.0.2, the following applies: require() will always attempt to read the target file, even if the line it's on never executes.
pt_br: Até o PHP 4.0.2, havia o seguinte comportamento: require() mesmo que a linha onde ele está nunca seja executada.

source: The conditional statement won' t affect require().
pt_br: É por isso que instruções condicionais não afetam require().

source: However, if the line on which the require() occurs is not executed, neither will any of the code in the target file be executed.
pt_br: Entretanto, se a linha onde ocorre o require() não for executada, nada do código incluído do arquivo também será.

source: Similarly, looping structures do not affect the behaviour of require().
pt_br: Similarmente, estruturas de loop não afetam o funcionamento do require().

source: Although the code contained in the target file is still subject to the loop, the require() itself happens only once.
pt_br: A instrução require() apenas ocorre uma vez.

source: See also include(), require_once(), include_once(), eval(), file(), readfile(), virtual() and include_path.
pt_br: Veja também: include(), require_once(), include_once(), eval(), file(), readfile(), virtual() e include_path.

source: The require_once() statement includes and evaluates the specified file during the execution of the script.
pt_br: A instrução require_once() incluí e avalia o arquivo especificado durante a execução do script.

source: This is a behavior similar to the require() This is a behavior similar to the require() statement, with the only difference being that if the code from a file has already been included, it will not be included again.
pt_br: Seu comportamento é similar ao da instrução require(), a não ser que o arquivo informado já tenha sido incluído, não refazendo a operação novamente.

source: See the documentation for require() for more information on how this statement works.
pt_br: Veja a documentação de require() para maiores informações sobre como essa instrução funciona.

source: require_once() should be used in cases where the same file might be included and evaluated more than once during a particular execution of a script, and you want to be sure that it is included exactly once to avoid problems with function redefinitions, variable value reassignments, etc.
pt_br: require_once() pode ser utilizado nos casos em que o mesmo arquivo pode acabar sendo incluído mais de uma vez durante a execução de um script em particular, quando na verdade ele só pode ser incluído apenas uma, para evitar problemas com redefinições de funções, alterações nos valores de variáveis, etc.

source: For examples on using require_once() and include_once(), look at the PEAR code included in the latest PHP source code distributions.
pt_br: Para exemplos de utilização de require_once() e include_once(), veja o código do PEAR incluído nas últimas distribuições do código fonte do PHP.

source: Be aware, that the behaviour of require_once() and include_once() may not be what you expect on a non case sensitive operating system (such as Windows).
pt_br: Esteja avisado que o comportamento de require_once() e include_once() pode não ser o que você espera em um sistema operacional insensitivo ao caso (como o Windows).

source: Example 12-8. require_once() is case sensitive
pt_br: Exemplo 12-8. require_once() é sensitivo ao caso
